Repository: kenichisutan/canadian-budget-en-fr-sentiment-analysis
Catalog: data/corpora/federal-budget/budget-2025-en-budget-2025-fr.tmx
Source language: en_en
Languages: fr_fr

source: To address the horrifying rise in hate, and hate-related crimes in our communities, including
fr_fr: Pour lutter contre l'augmentation horrifiante de la haine et des crimes haineux dans nos communautés,

source: numerous incidents of Antisemitism and Islamophobia, Canada's new government introduced the Combatting Hate Act , to better protect access to places of worship, schools, and community
fr_fr: notamment de nombreux incidents antisémites ou islamophobes, le nouveau gouvernement du Canada a déposé la Loi sur la lutte contre la haine , qui vise à mieux protéger l'accès aux lieux de

source: centres, and to more clearly address and denounce hate-motivated crimes.
fr_fr: culte, aux écoles et aux centres communautaires ainsi qu'à lutter plus clairement contre les crimes motivés par la haine et à les dénoncer.

source: Budget 2025 announces that the Minister of Public Safety will
fr_fr: Le budget de 2025 annonce que le ministre de la Sécurité publique consultera les

source: engage with the impacted communities to develop a comprehensive and equitable approach,
fr_fr: communautés touchées afin d'élaborer une approche équitable et globale, consistant notamment à

source: including through reforms to the Canada Community Security Program, to ensure Canadians are
fr_fr: réformer le Programme pour la sécurité communautaire du Canada, afin de garantir que les

source: no longer afraid because of who they are, how they worship, or where they gather.
fr_fr: Canadiens n'aient plus jamais peur de s'affirmer, de prier ou de se réunir.

source: details to be announced in due course.
fr_fr: supplémentaires seront communiqués en temps voulu.

source: Modernising the Meteorological Service of Canada
fr_fr: Moderniser le Service météorologique du Canada

source: For over 150 years, the Meteorological Service of Canada (MSC) has provided Canadians with
fr_fr: Depuis plus de 150 ans, le Service météorologique du Canada (SMC) fournit à la population

source: up-to-date information about the weather.
fr_fr: canadienne des renseignements à jour sur les conditions météorologiques.

source: The MSC's High-Performance Computing (HPC) solution is the
fr_fr: La solution de calcul de

source: only system in Canada capable of running the models required to produce weather forecasts, alerts,
fr_fr: haute performance du SMC est le seul système au Canada qui est en mesure d'exécuter les modèles

source: warnings, and climate projections.
fr_fr: requis pour produire des prévisions météorologiques, des alertes, des avertissements et des

source: This essential federal service supports Canadians and key sectors
fr_fr: Ce service fédéral essentiel appuie la population canadienne et

source: of the economy (e.g., agriculture, transport, and marine shipping) in making informed decisions that
fr_fr: facilitant la prise de décisions éclairées qui protègent les gens et leurs biens, favorisent l'essor

source: protect people, property, and foster economic growth, and provide timely information to emergency
fr_fr: économique et permettent de fournir des informations en temps opportun aux intervenants d'urgence et

source: responders and the CAF.
fr_fr: aux Forces armées canadiennes.

source: Canada's new government is investing in a modernised computing system for the MSC to ensure Canadians
fr_fr: Le nouveau gouvernement du Canada investit dans un système informatique modernisé pour le SMC afin de

source: have access to more reliable weather forecasts.
fr_fr: garantir aux Canadiens l'accès à des prévisions météorologiques plus fiables.

source: Budget 2025 proposes to provide $2.7 billion over nine years,
fr_fr: Le budget de 2025 propose d'affecter 2,7 milliards de dollars sur neuf ans, à

source: starting in 2025-26, with $57.4 million in remaining amortisation, to replace the
fr_fr: compter de 2025-2026, avec 57,4 millions de dollars en amortissement restant, pour

source: MSC's High-Performance Computing solution , put in place back-up systems in
fr_fr: remplacer la solution de calcul de haute performance du SMC, établir des

source: a separate location, and modernise the HPC operations.
fr_fr: systèmes de secours à un emplacement différent et moderniser les opérations de la solution de

source: Renewing Canada's National Public Alerting System
fr_fr: Renouveler le Système national d'alertes au public

source: The National Public Alerting System saves lives.
fr_fr: Le Système national d'alertes au public sauve des vies.

source: It warns of natural disasters,
fr_fr: Il permet de prévenir la

source: giving Canadians time to flee the area, and it reports on abducted children, helping to bring them
fr_fr: désignée. Il signale aussi les enlèvements d'enfants pour contribuer aux efforts visant à les

source: to safety.
fr_fr: retrouver.

source: The government is ensuring Canadians get these critical, lifesaving alerts by creating a
fr_fr: Le gouvernement veille à ce que les Canadiens reçoivent ces alertes cruciales qui peuvent

source: new National Public Alerting System model.
fr_fr: sauver des vies en créant un nouveau modèle de Système national d'alertes au

source: The Mass Casualty Commission recommended
fr_fr: public . La Commission des pertes massives a recommandé des changements transformateurs

source: transformative change to better prevent and respond to critical incidents and mass casualty events
fr_fr: afin de mieux prévenir et de gérer les incidents critiques et les événements entraînant un grand

source: in the future and make Canadian communities safer.
fr_fr: nombre de victimes à l'avenir, et de rendre les communautés canadiennes plus sûres.

source: These actions respond to the Commission's recommendations on public alerting.
fr_fr: Ces mesures répondent aux recommandations de la Commission des pertes massives concernant les alertes au public.

source: Budget 2025 proposes to provide $55.4 million over four years,
fr_fr: Le budget de 2025 propose d'accorder 55,4 millions de dollars sur quatre ans, à

source: starting in 2026-27 and $13.4 million ongoing to Public Safety Canada to support a
fr_fr: compter de 2026-2027, et 13,4 millions de dollars par année par la suite, à Sécurité

source: new National Public Alerting System model, ensuring Canadians continue to
fr_fr: publique Canada pour financer un nouveau modèle de Système national d'alertes au

source: receive Amber Alerts and warnings of imminent natural disasters, extreme weather events and
fr_fr: public afin que les Canadiens continuent de recevoir les alertes Amber, ainsi que

source: security threats so they can take action to protect themselves and their communities.
fr_fr: les messages destinés à les aviser de catastrophes naturelles imminentes, de phénomènes

source: Improving Preclearance at Canada's Borders
fr_fr: météorologiques extrêmes et de toute menace à la sécurité, pour qu'ils puissent faire le

source: Efficient and effective transportation across airports and marine ports is crucial to building one
fr_fr: Un transport efficace et efficient entre les aéroports et les ports maritimes est essentiel pour

source: Canadian economy and fostering trade.
fr_fr: assurer l'unité de l'économie canadienne et favoriser le commerce.

source: To make air and marine transport more seamless, the government
fr_fr: aérien et maritime plus fluide, le gouvernement investit dans l'amélioration du précontrôle aux

source: is investing in improving preclearance at Canada's borders.
fr_fr: frontières canadiennes.

source: Budget 2025 proposes to provide $14.8 million over four years,
fr_fr: Le budget de 2025 propose d'affecter 14,8 millions de dollars sur quatre ans à

source: starting in 2026-27, with $1.1 million in 2030-31 and $20.6 million in
fr_fr: Transports Canada, à compter de 2026-2027, avec 1,1 million de dollars

source: remaining amortisation, to Transport Canada to develop and implement a new preclearance
fr_fr: mettre en œuvre un nouveau régime d'accès au précontrôle, afin que toute la population

source: access regime, ensuring a more secure transportation system for Canadians.
fr_fr: canadienne profite d'un réseau de transport plus sûr.

source: Funding will also
fr_fr: Ce financement permettra aussi à

source: enable Transport Canada to invest in digital solutions to maximise efficiency in security
fr_fr: Transports Canada d'investir dans des solutions numériques pour optimiser le processus d'enquête

source: screening activities, supporting timely onboarding of employees in transportation facilities
fr_fr: de sécurité et ainsi faciliter l'intégration dans les meilleurs délais des employés dans les

source: across Canada.
fr_fr: installations de transport partout au pays.

source: This will complement the opening of the new preclearance facility at Billy
fr_fr: Ces mesures s'ajoutent à l'ouverture de la nouvelle

source: Bishop Airport, for which the government invested $30 million into in 2023.
fr_fr: installation de précontrôle à l'aéroport Billy Bishop, dans laquelle le gouvernement a investi

source: Removing Assault-Style Firearms from our Streets
fr_fr: 30 millions de dollars en 2023.

source: Weapons made for the battlefield do not belong on Canadian streets—where children walk to school,
fr_fr: Retirer de la circulation les armes à feu de style arme d'assaut Les armes conçues pour le champ de bataille n'ont pas leur place dans nos quartiers, parmi nos

source: where workers wait for the bus, and where you live.
fr_fr: enfants qui se rendent à l'école et les gens qui vont travailler.

source: To protect our communities, Canada's new
fr_fr: Afin de protéger nos communautés,

source: government is removing assault-style firearms from our streets.
fr_fr: le nouveau gouvernement du Canada retire de la circulation les armes à feu de style arme d'assaut.

source: These measures respond directly to the Mass Casualty Commission's recommendations.
fr_fr: Ces mesures donnent directement suite aux recommandations de la Commission des pertes massives.

source: Budget 2025 proposes to realign previously announced funding for a
fr_fr: Le budget de 2025 propose la restructuration d'un financement annoncé précédemment, dont

source: net fiscal impact of $38.7 million over three years, starting in 2025-26, to allow
fr_fr: l'incidence budgétaire nette sera de 38,7 millions de dollars sur trois ans à compter

source: for the continuation of the Assault-Style Firearms Compensation Program .
fr_fr: de 2025-2026, afin de permettre le maintien du Programme d'indemnisation pour les

source: The program will be implemented in the most efficient and cost-effective way possible,
fr_fr: armes à feu de style arme d'assaut . Le programme sera mis en œuvre de la manière la

source: within its existing funding envelope of $742 million.
fr_fr: plus efficiente et économique possible, dans les limites de son enveloppe de financement

source: Strengthening Canada's Emergency Management
fr_fr: Renforcer la gestion des urgences au pays

source: Wildfire seasons in Canada are becoming more severe and are having lasting impacts on the lives of
fr_fr: Les saisons des feux de forêt au Canada vont en s'aggravant et entraînent des répercussions à long

source: Protecting our communities from these devastating wildfires requires bold approaches and
fr_fr: Pour protéger nos communautés contre les feux de forêt dévastateurs,

source: committed, coordinated action from all levels of government.
fr_fr: tous les ordres de gouvernement doivent agir de manière concertée, avec audace et détermination.

source: Budget 2025 proposes to provide $257.6 million over four
fr_fr: Le budget de 2025 propose d'accorder 257,6 millions de dollars sur quatre ans, à

source: years, starting in 2026-27, to Natural Resources Canada to lease four aircraft to
fr_fr: compter de 2026-2027, à Ressources naturelles Canada pour permettre la location de quatre

source: bolster provincial and territorial aerial firefighting capacity.
fr_fr: appareils dans le but de renforcer la capacité des provinces et des territoires de lutter contre

source: 4.3 Building a Stronger Financial System
fr_fr: 4.3 Renforcer le système financier

source: In a world that is changing—with rising geopolitical, security, and natural disaster risks—protecting
fr_fr: Dans un monde en mutation où se multiplient les risques liés à la géopolitique, à la sécurité et aux

source: our communities also means ensuring Canadians and businesses have protections for their assets and
fr_fr: catastrophes naturelles, pour protéger nos communautés, il nous faut aussi veiller à ce qu'un

source: have a strong and secure financial system.
fr_fr: système financier solide et sûr garantisse la protection des actifs des Canadiens et des entreprises.

source: Combatting Financial Fraud
fr_fr: Combattre la fraude financière

source: From ghost texts and mysterious links, to masked voiceover calls and phony bank emails, financial
fr_fr: La fraude et la criminalité financières sont de plus en plus sophistiquées et difficiles à détecter,

source: fraud and crimes are becoming increasingly sophisticated and harder to detect—and remain an
fr_fr: qu'il s'agisse de messages textes provenant de numéros inconnus, d'envoi de liens mystérieux,

source: ever-growing threat to the financial well-being of Canadians everywhere.
fr_fr: d'appels vocaux masqués ou de faux courriels bancaires.

source: Seniors, newcomers, and
fr_fr: Elles constituent une menace sérieuse

source: other vulnerable populations are disproportionately affected.
fr_fr: croissante pour le bien-être financier des gens partout au pays.

source: In 2024 alone, the Canadian
fr_fr: Les aînés, les nouveaux arrivants

source: Anti-Fraud Centre reported that Canadians lost $643 million to fraud, representing nearly a
fr_fr: Uniquement en 2024, le Centre antifraude du Canada (CAFC) chiffrait les pertes à 643 millions de

source: 300 per cent increase since 2020, while only 5 to 10 per cent of scams
fr_fr: dollars au pays, soit une hausse de près de 300 % depuis 2020.

source: are reported.
fr_fr: On estime que

source: In response, the Government of Canada is taking decisive action to enhance enforcement measures and
fr_fr: Face à cette situation, le gouvernement du Canada prend des mesures décisives pour renforcer

source: ensure Canadians can feel confident that their financial systems are secure and resilient.
fr_fr: l'application de la loi et maintenir la confiance des Canadiens dans la sécurité et la résilience

source: whole-of-government National Anti-Fraud Strategy .
fr_fr: nationale antifraude , qui fera intervenir l'ensemble du gouvernement.

source: This strategy will bring
fr_fr: Cette stratégie réunira des institutions financières et des entreprises de technologie et de

source: together financial institutions, technology, and telecommunication companies to develop a
fr_fr: télécommunications afin d'élaborer une approche intersectorielle visant à protéger les Canadiens

source: cross-sectoral approach to protect Canadians from evolving and highly complex fraud schemes.
fr_fr: contre des stratagèmes frauduleux en constante évolution et extrêmement complexes.

source: Budget 2025 also announces the government's intention to amend the Bank Act and make relevant regulations to: Require banks to have policies and procedures to address consumer-targeted fraud.
fr_fr: Dans le budget de 2025, le gouvernement annonce aussi son intention de modifier la Loi sur les banques et les règlements pertinents pour : exiger que les banques adoptent des politiques et des procédures pour contrer la fraude ciblant

source: Allow consumers to adjust maximum transaction amounts, and require banks to obtain the
fr_fr: les consommateurs; permettre aux consommateurs d'établir le montant maximal des opérations pouvant être faites dans

source: express consent of consumers to enable certain account features and permit consumers to
fr_fr: leurs comptes bancaires et de désactiver certaines fonctions dont ils n'ont pas besoin, en

source: disable features they do not need, with these features to be prescribed in regulation.
fr_fr: d'activer certaines fonctions dans les comptes (ces fonctions seront précisées par

source: Require banks to report data on consumer-targeted fraud to the Financial Consumer Agency
fr_fr: règlement); exiger que les banques communiquent des données sur la fraude ciblant les consommateurs à

source: of Canada, with the specific data points to be prescribed in regulation.
fr_fr: l'Agence de la consommation en matière financière du Canada; les points de données en question

source: Anonymised data
fr_fr: Ces données anonymisées seraient ensuite transmises au ministre

source: would subsequently be reported to the Minister of Finance to inform the government's
fr_fr: des Finances pour guider l'élaboration des politiques relatives à la fraude financière.

source: future policymaking on financial fraud.
fr_fr: Veiller à ce que le crime ne paie pas

source: The government strongly supports Bill C-12, the Strengthening Canada's Immigration System and
fr_fr: Le gouvernement appuie vigoureusement le projet de loi C-12, la Loi visant à renforcer le

source: Borders Act , which includes a comprehensive package of measures to support Canada's fight
fr_fr: Ce projet de loi contient un train complet de mesures pour appuyer la lutte contre la criminalité financière au Canada.

source: against financial crimes.
fr_fr: Grâce à ces mesures, le

source: These measures will ensure Canada knows the businesses and professionals
fr_fr: gouvernement disposera de l'information requise sur les entreprises et les professionnels qui

source: that work every day to support Canada's Anti-Money Laundering/Anti-Terrorist Financing Regime and
fr_fr: travaillent chaque jour pour soutenir le Régime canadien de lutte contre le recyclage des produits

source: will strengthen supervision, compliance, and information sharing under the Proceeds of Crime
fr_fr: de la criminalité et le financement des activités terroristes. Ces mesures renforceront aussi les

source: (Money Laundering) and Terrorist Financing Act ( PCMLTFA ).
fr_fr: recyclage des produits de la criminalité et le financement des activités terroristes .

source: Complementing these measures, Budget 2025 confirms the government's intention to take steps to
fr_fr: En plus de ces mesures, le budget de 2025 confirme l'intention du gouvernement d'agir pour mieux

source: further protect Canadians and Canadian business from financial crimes.
fr_fr: protéger les Canadiens et les entreprises canadiennes contre la criminalité financière.

source: Budget 2025 proposes to protect businesses from being abused by
fr_fr: Le budget de 2025 propose de protéger les entreprises contre les abus commis par des

source: criminals by amending the PCMLTFA and its regulations to address the most prevalent
fr_fr: criminels en modifiant la Loi sur le recyclage des produits de la criminalité et le

source: forms of cash-based money laundering by restricting: large cash transactions of $10,000 or
fr_fr: les plus courantes de blanchiment d'argent en espèces, en limitant les transactions en espèces

source: more; and the depositing of cash by one person to another person's account (i.e.,
fr_fr: d'un montant supérieur ou égal à 10 000 $ et les dépôts en espèces effectués par une

source: third-party cash deposits).
fr_fr: personne sur le compte d'une autre personne (c'est-à-dire les dépôts en espèces par des tiers).

source: Canada launched in February a new Integrated Money Laundering Intelligence Partnership (IMLIP)
fr_fr: En février, le Canada a lancé le Partenariat intégré sur le renseignement en matière de blanchiment

source: between law enforcement and Canada's big banks.
fr_fr: d'argent (PIRBA) entre les organismes d'application de la loi et les grandes banques du Canada.

source: This partnership will bolster Canada's response to
fr_fr: Ce partenariat renforce la réponse du Canada au crime organisé et aux stratagèmes sophistiqués de

source: organised crime and high-end money laundering schemes, including related to fentanyl trafficking.
fr_fr: blanchiment d'argent, notamment en lien avec le trafic de fentanyl.

source: To support the IMLIP, Budget 2025 proposes amendments to the PCMLTFA with related amendments to the Personal Information Protection and
fr_fr: Pour appuyer le PIRBA, le gouvernement propose dans le budget de 2025 d'apporter des modifications à la Loi sur le recyclage des produits de la criminalité et le financement des

source: Electronic Documents Act to clarify public to private information sharing.
fr_fr: activités terroristes et des modifications connexes à la Loi sur la protection des

source: Strengthening the Review of Foreign Bank Investments
fr_fr: Renforcer l'examen des investissements de banques étrangères

source: Budget 2025 announces the government's intention to propose
fr_fr: Dans le budget de 2025, le gouvernement annonce son intention de proposer des modifications

source: legislative amendments to the Bank Act to enable the review of certain types of
fr_fr: législatives à la Loi sur les banques pour permettre l'examen de certains types

source: investments in Canadian businesses by foreign banks and their affiliates for national
fr_fr: d'investissements effectués par les banques étrangères et leurs filiales dans des entreprises

source: security risks.
fr_fr: canadiennes, sur la base des risques pour la sécurité nationale.

source: This would ensure consistency with how other foreign investments in Canada
fr_fr: cohérence avec le processus d'examen d'autres types d'investissements étrangers au Canada,

source: are assessed, including under the Investment Canada Act, to protect sensitive
fr_fr: particulièrement ceux qui sont visés par la Loi sur Investissement Canada , afin de

source: technology, infrastructure, or data.
fr_fr: protéger les technologies, les infrastructures ou les données sensibles.

source: The government will launch targeted consultations to
fr_fr: Le gouvernement tiendra

source: inform the proposed amendments.
fr_fr: des consultations ciblées en vue d'éclairer l'élaboration des modifications proposées.

source: Improving Insurance Resiliency Against Natural Disasters
fr_fr: Accroître la résilience du secteur de l'assurance face aux catastrophes naturelles

source: More can also be done to ensure Canadian consumers are protected by a resilient financial system in
fr_fr: Le gouvernement peut aussi en faire plus pour garantir que les consommateurs canadiens sont protégés

source: the face of extreme events like earthquakes.
fr_fr: par un système financier résilient en cas de phénomènes extrêmes, comme les tremblements de terre.

source: Budget 2025 announces the government's intention to consult
fr_fr: Dans le budget de 2025, le gouvernement annonce qu'il compte consulter les sociétés

source: federally regulated property and casualty insurers and other interested stakeholders on ways
fr_fr: d'assurances multirisques sous réglementation fédérale et les autres parties intéressées à

source: to ensure the stability of Canada's insurance sector in an extreme earthquake event.
fr_fr: propos des moyens d'assurer la stabilité du secteur des assurances du Canada en cas de séisme violent.

source: Budget 2025 takes action to protect diverse groups from a broad range of risks to their
fr_fr: groupes contre un large éventail de risques pouvant affecter leur sécurité et leur

source: safety and well-being by:
fr_fr: bien-être :

source: Removing Assault Style Firearms from our Streets, which prioritises
fr_fr: Retirer de la circulation les armes à feu de style arme d'assaut – Cette mesure accorde la priorité aux groupes les plus touchés par la

source: groups most affected by gun violence.
fr_fr: En 2023, les hommes de 18 ans et
